testCase3_interFoam_new/system/decomposeParDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2212                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      decomposeParDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

numberOfSubdomains 8;

method             scotch;


simpleCoeffs
{
	    n               ( 6 2 1 );
	        delta           0.001;
}

hierarchicalCoeffs
{
	    n               ( 1 1 1 );
	        delta           0.001;
		    order           xyz;
}

manualCoeffs
{
	    dataFile        "";
}

distributed     no;

roots           ( );



// ************************************************************************* //
